<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class CheckpointsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = 'Рава-Руська (Хребенне), Шегині (Медика), Ягодин (Дорогуськ), Устилуг (Зосін), Краківець (Корчова), Смільниця (Кросьценко), Грушів (Будомєж), Угринів (Долгобичув), Рава-Руська (Верхрата), Хирів (Кросьценко), Володимир-Волинський (Хрубешув), Мостиська (Пшемисль), Малий Березний (Убля), Ужгород (Вишнє-Нємецьке), Павлове (Матьовце), Чоп (Страж) (Чієрна над Тисою), Малі Селменці (Вельке Слеменце), Дзвінкове (Лонья), Косино (Барабаш), Вилок (Тісабеч), Чоп (Тиса, Захонь), Лужанка (Берегшурань), Чоп (Дружба, Захонь), Саловка (Еперєшке), Дякове (Халмеу), Солотвино (Сігету Мармацієй), Порубне (Сірет), Ізмаїл (Плаур), Вилкове (Переправа), Кілія (Кілія Веке), Тересва (Кимпулунг ла Тиса), Ділове (Валя Вишеулуй), Вадул-Сірет (Вікшани), Орлівка (Ісакча), Подвір’ївка (Липкань), Зелена (Медвеже), Вашківці (Гріменкеуць), Сокиряни (Клокушна), Сокиряни (Окниця), Велика Косниця (Хрушка), Грабарівка (Окниця), Болган (Хрістова), Студена (Ротар), Олексіївка (Валя Туркулуй), Шершенці (Валя Туркулуй), Домниця (Ковбасна), Тимкове (Броштень), Станіславка (Веренкеу), Федосіївка (Жура), Дубове (Дубеу), Платонове (Гоянул Ноу), Йосипівка (Колосово), Павлівка (Мочарівка), Великоплоське (Мелеєшть), Слов‘яносербка (Ближній Хутір), Гребеники (Тирасполь), Розалівка (Фрунзе (Нове)), Кучурган (Первомайськ), Градинці (Незавертайлівка), Лісне (Сеіць), Серпневе 1 (Басараб‘яска), Малоярославець 1 (Чадир-Лунга), Нові Трояни (Чадир-Лунга), Залізничне (Кайраклія), Табаки (Мирне), Виноградівка (Вулкенєшть), Долинське (Чишмікіой), Бронниця (Унгри), Мамалига (Крива), Кельменці (Ларга), Россошани (Брічень), Паланка (Маяки –Удобне) (Паланка), Старокозаче (Тудора), Рені (Джюрджюлешть), Могилів-Подільський (Отач), Цекинівка (Сорока), Ямпіль (Косеуць), Цекинівка (Сорока), Велика Косниця (Василькеу), Слобідка (Ковбасна), Кучурган (Новосавицьке), Фрікацей (Етулія), Рені (Джюрджюлешть), Могилів-Подільський (Волчинець)';

        $items = explode(', ', $data);

        foreach ($items as $item) {
            \DesiteGroup\LaravelNovaUaVolunteersWarehouseManagement\Models\Checkpoint::firstOrCreate([
                'name' => $item
            ]);
        }
    }
}
